STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_ca35.h
  __IO uint32_t DMAC1RXDLAR;                          /*!< Channel 1 R1 descriptor list address register              Address offset: 0x119C */
  __IO uint32_t DMAC1TXDTPR;                          /*!< Channel 1 T1 descriptor tail pointer register              Address offset: 0x11A0 */
       uint32_t RESERVED68;                           /*!< Reserved                                                   Address offset: 0x11A4 */
  __IO uint32_t DMAC1RXDTPR;                          /*!< Channel 1 R1 descriptor tail pointer register              Address offset: 0x11A8 */
  __IO uint32_t DMAC1TXRLR;                           /*!< Channel 1 T1 descriptor ring length register               Address offset: 0x11AC */
  __IO uint32_t DMAC1RXRLR;                           /*!< Channel 1 R1 descriptor ring length register               Address offset: 0x11B0 */
  __IO uint32_t DMAC1IER;                             /*!< Channel 1 interrupt enable register                        Address offset: 0x11B4 */
  __IO uint32_t DMAC1RXIWTR;                          /*!< Channel 1 R1 interrupt watchdog timer register             Address offset: 0x11B8 */
  __IO uint32_t DMAC1SFCSR;                           /*!< Channel 1 slot function control status register            Address offset: 0x11BC */
       uint32_t RESERVED69;                           /*!< Reserved                                                   Address offset: 0x11C0 */
  __IO uint32_t DMAC1CATXDR;                          /*!< Channel 1 current application transmit descriptor register Address offset: 0x11C4 */
       uint32_t RESERVED70;                           /*!< Reserved                                                   Address offset: 0x11C8 */
  __IO uint32_t DMAC1CARXDR;                          /*!< Channel 1 current application receive descriptor register  Address offset: 0x11CC */
       uint32_t RESERVED71;                           /*!< Reserved                                                   Address offset: 0x11D0 */
  __IO uint32_t DMAC1CATXBR;                          /*!< Channel 1 current application transmit buffer register     Address offset: 0x11D4 */
       uint32_t RESERVED72;                           /*!< Reserved                                                   Address offset: 0x11D8 */
  __IO uint32_t DMAC1CARXBR;                          /*!< Channel 1 current application receive buffer register      Address offset: 0x11DC */
  __IO uint32_t DMAC1SR;                              /*!< Channel 1 status register                                  Address offset: 0x11E0 */
  __IO uint32_t DMAC1MFCR;                            /*!< Channel 1 missed frame count register                      Address offset: 0x11E4 */
       uint32_t RESERVED73[6];                        /*!< Reserved                                                   Address offset: 0x11E8-0x11FC */
  __IO uint32_t DMAC2CR;                              /*!< Channel 2 control register                                 Address offset: 0x1200 */
  __IO uint32_t DMAC2TXCR;                            /*!< Channel 2 transmit control register                        Address offset: 0x1204 */
       uint32_t RESERVED74[3];                        /*!< Reserved                                                   Address offset: 0x1208-0x1210 */
  __IO uint32_t DMAC2TXDLAR;                          /*!< Channel 2 T2 descriptor list address register              Address offset: 0x1214 */
       uint32_t RESERVED75[2];                        /*!< Reserved                                                   Address offset: 0x1218-0x121C */
  __IO uint32_t DMAC2TXDTPR;                          /*!< Channel 2 T2 descriptor tail pointer register              Address offset: 0x1220 */
       uint32_t RESERVED76[2];                        /*!< Reserved                                                   Address offset: 0x1224-0x1228 */
  __IO uint32_t DMAC2TXRLR;                           /*!< Channel 2 T2 descriptor ring length register               Address offset: 0x122C */
       uint32_t RESERVED77;                           /*!< Reserved                                                   Address offset: 0x1230 */
  __IO uint32_t DMAC2IER;                             /*!< Channel 2 interrupt enable register                        Address offset: 0x1234 */
       uint32_t RESERVED78;                           /*!< Reserved                                                   Address offset: 0x1238 */
  __IO uint32_t DMAC2SFCSR;                           /*!< Channel 2 slot function control status register            Address offset: 0x123C */
       uint32_t RESERVED79;                           /*!< Reserved                                                   Address offset: 0x1240 */
  __IO uint32_t DMAC2CATXDR;                          /*!< Channel 2 current application transmit descriptor register Address offset: 0x1244 */
       uint32_t RESERVED80[3];                        /*!< Reserved                                                   Address offset: 0x1248-0x1250 */
  __IO uint32_t DMAC2CATXBR;                          /*!< Channel 2 current application transmit buffer register     Address offset: 0x1254 */
       uint32_t RESERVED81[2];                        /*!< Reserved                                                   Address offset: 0x1258-0x125C */
  __IO uint32_t DMAC2SR;                              /*!< Channel 2 status register                                  Address offset: 0x1260 */
       uint32_t RESERVED82[7];                        /*!< Reserved                                                   Address offset: 0x1264-0x127C */
  __IO uint32_t DMAC3CR;                              /*!< Channel 3 control register                                 Address offset: 0x1280 */
  __IO uint32_t DMAC3TXCR;                            /*!< Channel 3 transmit control register                        Address offset: 0x1284 */
       uint32_t RESERVED83[3];                        /*!< Reserved                                                   Address offset: 0x1288-0x1290 */
  __IO uint32_t DMAC3TXDLAR;                          /*!< Channel 3 T3 descriptor list address register              Address offset: 0x1294 */
       uint32_t RESERVED84[2];                        /*!< Reserved                                                   Address offset: 0x1298-0x129C */
  __IO uint32_t DMAC3TXDTPR;                          /*!< Channel 3 T3 descriptor tail pointer register              Address offset: 0x12A0 */
       uint32_t RESERVED85[2];                        /*!< Reserved                                                   Address offset: 0x12A4-0x12A8 */
  __IO uint32_t DMAC3TXRLR;                           /*!< Channel 3 T3 descriptor ring length register               Address offset: 0x12AC */
       uint32_t RESERVED86;                           /*!< Reserved                                                   Address offset: 0x12B0 */
  __IO uint32_t DMAC3IER;                             /*!< Channel 3 interrupt enable register                        Address offset: 0x12B4 */
       uint32_t RESERVED87;                           /*!< Reserved                                                   Address offset: 0x12B8 */
  __IO uint32_t DMAC3SFCSR;                           /*!< Channel 3 slot function control status register            Address offset: 0x12BC */
       uint32_t RESERVED88;                           /*!< Reserved                                                   Address offset: 0x12C0 */
  __IO uint32_t DMAC3CATXDR;                          /*!< Channel 3 current application transmit descriptor register Address offset: 0x12C4 */
       uint32_t RESERVED89[3];                        /*!< Reserved                                                   Address offset: 0x12C8-0x12D0 */
  __IO uint32_t DMAC3CATXBR;                          /*!< Channel 3 current application transmit buffer register     Address offset: 0x12D4 */
       uint32_t RESERVED90[2];                        /*!< Reserved                                                   Address offset: 0x12D8-0x12DC */
  __IO uint32_t DMAC3SR;                              /*!< Channel 3 status register                                  Address offset: 0x12E0 */
} ETH_TypeDef;

