STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_ca35.h
/***************  Bit definition for LVDS_PMPLLTESTCR register  ***************/
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_CLK_EN_Pos               (0U)
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_CLK_EN_Msk               (0x1UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_CLK_EN_Pos)               /*!< 0x00000001 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_CLK_EN                   LVDS_PMPLLTESTCR_MST_PLL_TEST_CLK_EN_Msk                         /*!< lvds_pll_test_clk enable */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_EN_Pos               (8U)
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_EN_Msk               (0x1UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_EN_Pos)               /*!< 0x00000100 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_EN                   LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_EN_Msk                         /*!< lvds_pll_test_clk dividers enable */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos         (16U)
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Msk         (0x3FFUL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)       /*!< 0x03FF0000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS             LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Msk                   /*!< lvds_pll_test_clk dividers value */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_0           (0x1UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)     /*!< 0x00010000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_1           (0x2UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)     /*!< 0x00020000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_2           (0x4UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)     /*!< 0x00040000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_3           (0x8UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)     /*!< 0x00080000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_4           (0x10UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)    /*!< 0x00100000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_5           (0x20UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)    /*!< 0x00200000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_6           (0x40UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)    /*!< 0x00400000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_7           (0x80UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)    /*!< 0x00800000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_8           (0x100UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)   /*!< 0x01000000 */
#define LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_9           (0x200UL << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos)   /*!< 0x02000000 */

/******************  Bit definition for LVDS_PSGCR register  ******************/
#define LVDS_PSGCR_SLV_BIT_CLK_OUT_ENABLE_Pos                  (0U)
#define LVDS_PSGCR_SLV_BIT_CLK_OUT_ENABLE_Msk                  (0x1UL << LVDS_PSGCR_SLV_BIT_CLK_OUT_ENABLE_Pos)                  /*!< 0x00000001 */
#define LVDS_PSGCR_SLV_BIT_CLK_OUT_ENABLE                      LVDS_PSGCR_SLV_BIT_CLK_OUT_ENABLE_Msk                            /*!< Enable LVDS-PHY bit_clk clock */
#define LVDS_PSGCR_SLV_LS_CLK_OUT_ENABLE_Pos                   (4U)
#define LVDS_PSGCR_SLV_LS_CLK_OUT_ENABLE_Msk                   (0x1UL << LVDS_PSGCR_SLV_LS_CLK_OUT_ENABLE_Pos)                   /*!< 0x00000010 */
#define LVDS_PSGCR_SLV_LS_CLK_OUT_ENABLE                       LVDS_PSGCR_SLV_LS_CLK_OUT_ENABLE_Msk                             /*!< Enable LVDS-PHY ls_clk clock */
#define LVDS_PSGCR_SLV_DP_CLK_OUT_ENABLE_Pos                   (8U)
#define LVDS_PSGCR_SLV_DP_CLK_OUT_ENABLE_Msk                   (0x1UL << LVDS_PSGCR_SLV_DP_CLK_OUT_ENABLE_Pos)                   /*!< 0x00000100 */
#define LVDS_PSGCR_SLV_DP_CLK_OUT_ENABLE                       LVDS_PSGCR_SLV_DP_CLK_OUT_ENABLE_Msk                             /*!< Enable LVDS-PHY dp_clk clock */
#define LVDS_PSGCR_SLV_RSTZ_Pos                                (24U)
#define LVDS_PSGCR_SLV_RSTZ_Msk                                (0x1UL << LVDS_PSGCR_SLV_RSTZ_Pos)                                /*!< 0x01000000 */
#define LVDS_PSGCR_SLV_RSTZ                                    LVDS_PSGCR_SLV_RSTZ_Msk                                          /*!< When set to 0, this bit places the digital section of the LVDS-PHY in the reset state */
#define LVDS_PSGCR_SLV_DIVIDERS_RSTN_Pos                       (25U)
#define LVDS_PSGCR_SLV_DIVIDERS_RSTN_Msk                       (0x1UL << LVDS_PSGCR_SLV_DIVIDERS_RSTN_Pos)                       /*!< 0x02000000 */
#define LVDS_PSGCR_SLV_DIVIDERS_RSTN                           LVDS_PSGCR_SLV_DIVIDERS_RSTN_Msk                                 /*!< When set to 0, reset the output dividers */

/*****************  Bit definition for LVDS_PSPEACR register  *****************/
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_Pos                  (0U)
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_Msk                  (0xFUL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x0000000F */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0                      LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_Msk                            /*!< Amplitude control for pre-emphasis for lane0 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_0                    (0x1UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x00000001 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_1                    (0x2UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x00000002 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_2                    (0x4UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x00000004 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_3                    (0x8UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x00000008 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_Pos                  (4U)
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_Msk                  (0xFUL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_Pos)                  /*!< 0x000000F0 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1                      LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_Msk                            /*!< Amplitude control for pre-emphasis for lane1 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_0                    (0x1UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_Pos)                 /*!< 0x00000010 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_1                    (0x2UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_Pos)                 /*!< 0x00000020 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_2                    (0x4UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_Pos)                 /*!< 0x00000040 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_3                    (0x8UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL1_Pos)                 /*!< 0x00000080 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_Pos                  (8U)
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_Msk                  (0xFUL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_Pos)                  /*!< 0x00000F00 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2                      LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_Msk                            /*!< Amplitude control for pre-emphasis for lane2 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_0                    (0x1UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_Pos)                /*!< 0x00000100 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_1                    (0x2UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_Pos)                /*!< 0x00000200 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_2                    (0x4UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_Pos)                /*!< 0x00000400 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_3                    (0x8UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL2_Pos)                /*!< 0x00000800 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_Pos                  (12U)
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_Msk                  (0xFUL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_Pos)                  /*!< 0x0000F000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3                      LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_Msk                            /*!< Amplitude control for pre-emphasis for lane3 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_0                    (0x1UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_Pos)               /*!< 0x00001000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_1                    (0x2UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_Pos)               /*!< 0x00002000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_2                    (0x4UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_Pos)               /*!< 0x00004000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_3                    (0x8UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL3_Pos)               /*!< 0x00008000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_Pos                  (16U)
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_Msk                  (0xFUL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_Pos)                  /*!< 0x000F0000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4                      LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_Msk                            /*!< Amplitude control for pre-emphasis for lane4 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_0                    (0x1UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_Pos)              /*!< 0x00010000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_1                    (0x2UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_Pos)              /*!< 0x00020000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_2                    (0x4UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_Pos)              /*!< 0x00040000 */
#define LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_3                    (0x8UL << LVDS_PSPEACR_SLV_PRE_EMPH_AMP_DL4_Pos)              /*!< 0x00080000 */

/*****************  Bit definition for LVDS_PSPETCR register  *****************/
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0_Pos                 (0U)
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0_Msk                 (0x3UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0_Pos)                 /*!< 0x00000003 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0                     LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0_Msk                           /*!< Time duration control for pre-emphasis for lane0 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0_0                   (0x1UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0_Pos)                 /*!< 0x00000001 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0_1                   (0x2UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL0_Pos)                 /*!< 0x00000002 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1_Pos                 (4U)
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1_Msk                 (0x3UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1_Pos)                 /*!< 0x00000030 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1                     LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1_Msk                           /*!< Time duration control for pre-emphasis for lane1 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1_0                   (0x1UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1_Pos)                /*!< 0x00000010 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1_1                   (0x2UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL1_Pos)                /*!< 0x00000020 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2_Pos                 (8U)
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2_Msk                 (0x3UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2_Pos)                 /*!< 0x00000300 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2                     LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2_Msk                           /*!< Time duration control for pre-emphasis for lane2 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2_0                   (0x1UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2_Pos)               /*!< 0x00000100 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2_1                   (0x2UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL2_Pos)               /*!< 0x00000200 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3_Pos                 (12U)
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3_Msk                 (0x3UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3_Pos)                 /*!< 0x00003000 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3                     LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3_Msk                           /*!< Time duration control for pre-emphasis for lane3 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3_0                   (0x1UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3_Pos)              /*!< 0x00001000 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3_1                   (0x2UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL3_Pos)              /*!< 0x00002000 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4_Pos                 (16U)
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4_Msk                 (0x3UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4_Pos)                 /*!< 0x00030000 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4                     LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4_Msk                           /*!< Time duration control for pre-emphasis for lane4 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4_0                   (0x1UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4_Pos)             /*!< 0x00010000 */
#define LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4_1                   (0x2UL << LVDS_PSPETCR_SLV_PRE_EMPH_TIME_DL4_Pos)             /*!< 0x00020000 */

/*****************  Bit definition for LVDS_PSCMCR1 register  *****************/
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_Pos                   (0U)
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_Msk                   (0xFUL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x0000000F */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0                       LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_Msk                             /*!< Amplitude control for current mode driver, data lane0 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_0                     (0x1UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x00000001 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_1                     (0x2UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x00000002 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_2                     (0x4UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x00000004 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_3                     (0x8UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x00000008 */
#define LVDS_PSCMCR1_SLV_CM_EN_DL0_Pos                         (4U)
#define LVDS_PSCMCR1_SLV_CM_EN_DL0_Msk                         (0x1UL << LVDS_PSCMCR1_SLV_CM_EN_DL0_Pos)                         /*!< 0x00000010 */
#define LVDS_PSCMCR1_SLV_CM_EN_DL0                             LVDS_PSCMCR1_SLV_CM_EN_DL0_Msk                                   /*!< Enable for current mode driver, data lane0 */
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL0_Pos                (5U)
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL0_Msk                (0x1UL << LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL0_Pos)                /*!< 0x00000020 */
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL0                    LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL0_Msk                          /*!< common mode of datalane0: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL0_Pos                (6U)
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL0_Msk                (0x1UL << LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL0_Pos)                /*!< 0x00000040 */
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL0                    LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL0_Msk                          /*!< common mode of datalane0: when high, reference is mid voltage of the driver levels */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_Pos                   (8U)
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_Msk                   (0xFUL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_Pos)                   /*!< 0x00000F00 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1                       LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_Msk                             /*!< Amplitude control for current mode driver, data lane1 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_0                     (0x1UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_Pos)                 /*!< 0x00000100 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_1                     (0x2UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_Pos)                 /*!< 0x00000200 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_2                     (0x4UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_Pos)                 /*!< 0x00000400 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_3                     (0x8UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL1_Pos)                 /*!< 0x00000800 */
#define LVDS_PSCMCR1_SLV_CM_EN_DL1_Pos                         (12U)
#define LVDS_PSCMCR1_SLV_CM_EN_DL1_Msk                         (0x1UL << LVDS_PSCMCR1_SLV_CM_EN_DL1_Pos)                         /*!< 0x00001000 */
#define LVDS_PSCMCR1_SLV_CM_EN_DL1                             LVDS_PSCMCR1_SLV_CM_EN_DL1_Msk                                   /*!< Enable for current mode driver, data lane1 */
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL1_Pos                (13U)
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL1_Msk                (0x1UL << LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL1_Pos)                /*!< 0x00002000 */
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL1                    LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL1_Msk                          /*!< common mode of datalane1: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL1_Pos                (14U)
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL1_Msk                (0x1UL << LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL1_Pos)                /*!< 0x00004000 */
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL1                    LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL1_Msk                          /*!< common mode of datalane1: when high, reference is mid voltage of the driver levels */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_Pos                   (16U)
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_Msk                   (0xFUL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_Pos)                   /*!< 0x000F0000 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2                       LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_Msk                             /*!< Amplitude control for current mode driver, data lane2 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_0                     (0x1UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_Pos)               /*!< 0x00010000 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_1                     (0x2UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_Pos)               /*!< 0x00020000 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_2                     (0x4UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_Pos)               /*!< 0x00040000 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_3                     (0x8UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL2_Pos)               /*!< 0x00080000 */
#define LVDS_PSCMCR1_SLV_CM_EN_DL2_Pos                         (20U)
#define LVDS_PSCMCR1_SLV_CM_EN_DL2_Msk                         (0x1UL << LVDS_PSCMCR1_SLV_CM_EN_DL2_Pos)                         /*!< 0x00100000 */
#define LVDS_PSCMCR1_SLV_CM_EN_DL2                             LVDS_PSCMCR1_SLV_CM_EN_DL2_Msk                                   /*!< Enable for current mode driver, data lane2 */
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL2_Pos                (21U)
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL2_Msk                (0x1UL << LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL2_Pos)                /*!< 0x00200000 */
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL2                    LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL2_Msk                          /*!< common mode of datalane2: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL2_Pos                (22U)
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL2_Msk                (0x1UL << LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL2_Pos)                /*!< 0x00400000 */
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL2                    LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL2_Msk                          /*!< common mode of datalane2: when high, reference is mid voltage of the driver levels */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_Pos                   (24U)
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_Msk                   (0xFUL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_Pos)                   /*!< 0x0F000000 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3                       LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_Msk                             /*!< Amplitude control for current mode driver, data lane3 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_0                     (0x1UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_Pos)             /*!< 0x01000000 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_1                     (0x2UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_Pos)             /*!< 0x02000000 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_2                     (0x4UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_Pos)             /*!< 0x04000000 */
#define LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_3                     (0x8UL << LVDS_PSCMCR1_SLV_CM_AMP_CTRL_DL3_Pos)             /*!< 0x08000000 */
#define LVDS_PSCMCR1_SLV_CM_EN_DL3_Pos                         (28U)
#define LVDS_PSCMCR1_SLV_CM_EN_DL3_Msk                         (0x1UL << LVDS_PSCMCR1_SLV_CM_EN_DL3_Pos)                         /*!< 0x10000000 */
#define LVDS_PSCMCR1_SLV_CM_EN_DL3                             LVDS_PSCMCR1_SLV_CM_EN_DL3_Msk                                   /*!< Enable for current mode driver, data lane3 */
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL3_Pos                (29U)
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL3_Msk                (0x1UL << LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL3_Pos)                /*!< 0x20000000 */
#define LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL3                    LVDS_PSCMCR1_SLV_CM_USE_VDD_REF_DL3_Msk                          /*!< common mode of datalane3: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL3_Pos                (30U)
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL3_Msk                (0x1UL << LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL3_Pos)                /*!< 0x40000000 */
#define LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL3                    LVDS_PSCMCR1_SLV_CM_USE_VM_VMID_DL3_Msk                          /*!< common mode of datalane3: when high, reference is mid voltage of the driver levels */

