STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_ca35.h
/* Bit fields for RCC_USB3DRDCFGR register */
#define RCC_USB3DRDCFGR_USB3DRDRST_Pos               (0U)
#define RCC_USB3DRDCFGR_USB3DRDRST_Msk               (0x1UL << RCC_USB3DRDCFGR_USB3DRDRST_Pos)              /*!< 0x00000001 */
#define RCC_USB3DRDCFGR_USB3DRDRST                   RCC_USB3DRDCFGR_USB3DRDRST_Msk                        /*!< USB3DRD reset */
#define RCC_USB3DRDCFGR_USB3DRDEN_Pos                (1U)
#define RCC_USB3DRDCFGR_USB3DRDEN_Msk                (0x1UL << RCC_USB3DRDCFGR_USB3DRDEN_Pos)               /*!< 0x00000002 */
#define RCC_USB3DRDCFGR_USB3DRDEN                    RCC_USB3DRDCFGR_USB3DRDEN_Msk                         /*!< USB3DRD peripheral clocks enable */
#define RCC_USB3DRDCFGR_USB3DRDLPEN_Pos              (2U)
#define RCC_USB3DRDCFGR_USB3DRDLPEN_Msk              (0x1UL << RCC_USB3DRDCFGR_USB3DRDLPEN_Pos)             /*!< 0x00000004 */
#define RCC_USB3DRDCFGR_USB3DRDLPEN                  RCC_USB3DRDCFGR_USB3DRDLPEN_Msk                       /*!< USB3DRD clock enable during CSleep  */
#define RCC_USB3DRDCFGR_USB3DRDSTPEN_Pos             (4U)
#define RCC_USB3DRDCFGR_USB3DRDSTPEN_Msk             (0x1UL << RCC_USB3DRDCFGR_USB3DRDSTPEN_Pos)            /*!< 0x00000010 */
#define RCC_USB3DRDCFGR_USB3DRDSTPEN                 RCC_USB3DRDCFGR_USB3DRDSTPEN_Msk                      /*!< USB3DRD clock enable during CStop  */

/* Bit fields for RCC_USB3PCIEPHYCFGR register */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST_Pos       (0U)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST_Msk       (0x1UL << RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST_Pos)      /*!< 0x00000001 */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST           RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST_Msk                /*!< USB3PCIEPHY reset */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN_Pos        (1U)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN_Msk        (0x1UL << RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN_Pos)       /*!< 0x00000002 */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN            RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN_Msk                 /*!< USB3PCIEPHY clock enable */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN_Pos      (2U)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN_Msk      (0x1UL << RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN_Pos)     /*!< 0x00000004 */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN          RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN_Msk               /*!< USB3PCIEPHY clock enable during CSleep  */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYSTPEN_Pos     (4U)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYSTPEN_Msk     (0x1UL << RCC_USB3PCIEPHYCFGR_USB3PCIEPHYSTPEN_Pos)    /*!< 0x00000010 */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYSTPEN         RCC_USB3PCIEPHYCFGR_USB3PCIEPHYSTPEN_Msk              /*!< USB3PCIEPHY reference clock enable during CStop  */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL_Pos  (15U)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL_Msk  (0x1UL << RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL_Pos) /*!< 0x00008000 */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL      RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL_Msk           /*!< USB3PCIEPHY reference clock selection */

/* Bit fields for RCC_PCIECFGR register */
#define RCC_PCIECFGR_PCIERST_Pos                     (0U)
#define RCC_PCIECFGR_PCIERST_Msk                     (0x1UL << RCC_PCIECFGR_PCIERST_Pos)                    /*!< 0x00000001 */
#define RCC_PCIECFGR_PCIERST                         RCC_PCIECFGR_PCIERST_Msk                              /*!< PCIE reset */
#define RCC_PCIECFGR_PCIEEN_Pos                      (1U)
#define RCC_PCIECFGR_PCIEEN_Msk                      (0x1UL << RCC_PCIECFGR_PCIEEN_Pos)                     /*!< 0x00000002 */
#define RCC_PCIECFGR_PCIEEN                          RCC_PCIECFGR_PCIEEN_Msk                               /*!< PCIE clock enable */
#define RCC_PCIECFGR_PCIELPEN_Pos                    (2U)
#define RCC_PCIECFGR_PCIELPEN_Msk                    (0x1UL << RCC_PCIECFGR_PCIELPEN_Pos)                   /*!< 0x00000004 */
#define RCC_PCIECFGR_PCIELPEN                        RCC_PCIECFGR_PCIELPEN_Msk                             /*!< PCIE clock enable during CSleep  */
#define RCC_PCIECFGR_PCIESTPEN_Pos                   (4U)
#define RCC_PCIECFGR_PCIESTPEN_Msk                   (0x1UL << RCC_PCIECFGR_PCIESTPEN_Pos)                  /*!< 0x00000010 */
#define RCC_PCIECFGR_PCIESTPEN                       RCC_PCIECFGR_PCIESTPEN_Msk                            /*!< PCIE clock enable during CStop  */
/*****************  Bit definition for RCC_UCPDCFGR register  *****************/
#define RCC_UCPDCFGR_UCPDRST_Pos                     (0U)
#define RCC_UCPDCFGR_UCPDRST_Msk                     (0x1UL << RCC_UCPDCFGR_UCPDRST_Pos)                    /*!< 0x00000001 */
#define RCC_UCPDCFGR_UCPDRST                         RCC_UCPDCFGR_UCPDRST_Msk                              /*!< UCPD reset */
#define RCC_UCPDCFGR_UCPDEN_Pos                      (1U)
#define RCC_UCPDCFGR_UCPDEN_Msk                      (0x1UL << RCC_UCPDCFGR_UCPDEN_Pos)                     /*!< 0x00000002 */
#define RCC_UCPDCFGR_UCPDEN                          RCC_UCPDCFGR_UCPDEN_Msk                               /*!< UCPD clock enable */
#define RCC_UCPDCFGR_UCPDLPEN_Pos                    (2U)
#define RCC_UCPDCFGR_UCPDLPEN_Msk                    (0x1UL << RCC_UCPDCFGR_UCPDLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_UCPDCFGR_UCPDLPEN                        RCC_UCPDCFGR_UCPDLPEN_Msk                             /*!< UCPD clock enable during CSleep  */

/* Bit fields for RCC_ETHSWCFGR register */
#define RCC_ETHSWCFGR_ETHSWRST_Pos                   (0U)
#define RCC_ETHSWCFGR_ETHSWRST_Msk                   (0x1UL << RCC_ETHSWCFGR_ETHSWRST_Pos)                  /*!< 0x00000001 */
#define RCC_ETHSWCFGR_ETHSWRST                       RCC_ETHSWCFGR_ETHSWRST_Msk                            /*!< ETHSW reset */
#define RCC_ETHSWCFGR_ETHSWMACEN_Pos                 (1U)
#define RCC_ETHSWCFGR_ETHSWMACEN_Msk                 (0x1UL << RCC_ETHSWCFGR_ETHSWMACEN_Pos)                /*!< 0x00000002 */
#define RCC_ETHSWCFGR_ETHSWMACEN                     RCC_ETHSWCFGR_ETHSWMACEN_Msk                          /*!< ETHSW clock enable */
#define RCC_ETHSWCFGR_ETHSWMACLPEN_Pos               (2U)
#define RCC_ETHSWCFGR_ETHSWMACLPEN_Msk               (0x1UL << RCC_ETHSWCFGR_ETHSWMACLPEN_Pos)              /*!< 0x00000004 */
#define RCC_ETHSWCFGR_ETHSWMACLPEN                   RCC_ETHSWCFGR_ETHSWMACLPEN_Msk                        /*!< ETHSW clock enable during CSleep  */
#define RCC_ETHSWCFGR_ETHSWEN_Pos                    (5U)
#define RCC_ETHSWCFGR_ETHSWEN_Msk                    (0x1UL << RCC_ETHSWCFGR_ETHSWEN_Pos)                   /*!< 0x00000020 */
#define RCC_ETHSWCFGR_ETHSWEN                        RCC_ETHSWCFGR_ETHSWEN_Msk                             /*!< ETHSW ck_ker_ethsw kernel clock enable */
#define RCC_ETHSWCFGR_ETHSWLPEN_Pos                  (6U)
#define RCC_ETHSWCFGR_ETHSWLPEN_Msk                  (0x1UL << RCC_ETHSWCFGR_ETHSWLPEN_Pos)                 /*!< 0x00000040 */
#define RCC_ETHSWCFGR_ETHSWLPEN                      RCC_ETHSWCFGR_ETHSWLPEN_Msk                           /*!< ETHSW ck_ker_ethsw kernel clock enable during CSleep  */
#define RCC_ETHSWCFGR_ETHSWREFEN_Pos                 (21U)
#define RCC_ETHSWCFGR_ETHSWREFEN_Msk                 (0x1UL << RCC_ETHSWCFGR_ETHSWREFEN_Pos)                /*!< 0x00200000 */
#define RCC_ETHSWCFGR_ETHSWREFEN                     RCC_ETHSWCFGR_ETHSWREFEN_Msk                          /*!< ETHSW ck_ker_ethswref kernel clock enable */
#define RCC_ETHSWCFGR_ETHSWREFLPEN_Pos               (22U)
#define RCC_ETHSWCFGR_ETHSWREFLPEN_Msk               (0x1UL << RCC_ETHSWCFGR_ETHSWREFLPEN_Pos)              /*!< 0x00400000 */
#define RCC_ETHSWCFGR_ETHSWREFLPEN                   RCC_ETHSWCFGR_ETHSWREFLPEN_Msk                        /*!< ETHSW ck_ker_ethswref kernel clock enable during CSleep  */

/* Bit fields for RCC_ETHSWACMCFGR register */
#define RCC_ETHSWACMCFGR_ETHSWACMEN_Pos              (1U)
#define RCC_ETHSWACMCFGR_ETHSWACMEN_Msk              (0x1UL << RCC_ETHSWACMCFGR_ETHSWACMEN_Pos)             /*!< 0x00000002 */
#define RCC_ETHSWACMCFGR_ETHSWACMEN                  RCC_ETHSWACMCFGR_ETHSWACMEN_Msk                       /*!< ETHSW_ACM clock enable */
#define RCC_ETHSWACMCFGR_ETHSWACMLPEN_Pos            (2U)
#define RCC_ETHSWACMCFGR_ETHSWACMLPEN_Msk            (0x1UL << RCC_ETHSWACMCFGR_ETHSWACMLPEN_Pos)           /*!< 0x00000004 */
#define RCC_ETHSWACMCFGR_ETHSWACMLPEN                RCC_ETHSWACMCFGR_ETHSWACMLPEN_Msk                     /*!< ETHSW_ACM clock enable during CSleep  */

/* Bit fields for RCC_ETHSWACMMSGCFGR register */
#define RCC_ETHSWACMMSGCFGR_ETHSWACMMSGEN_Pos        (1U)
#define RCC_ETHSWACMMSGCFGR_ETHSWACMMSGEN_Msk        (0x1UL << RCC_ETHSWACMMSGCFGR_ETHSWACMMSGEN_Pos)       /*!< 0x00000002 */
#define RCC_ETHSWACMMSGCFGR_ETHSWACMMSGEN            RCC_ETHSWACMMSGCFGR_ETHSWACMMSGEN_Msk                 /*!< ETHSW_ACM message buffer clock enable */
#define RCC_ETHSWACMMSGCFGR_ETHSWACMMSGLPEN_Pos      (2U)
#define RCC_ETHSWACMMSGCFGR_ETHSWACMMSGLPEN_Msk      (0x1UL << RCC_ETHSWACMMSGCFGR_ETHSWACMMSGLPEN_Pos)     /*!< 0x00000004 */
#define RCC_ETHSWACMMSGCFGR_ETHSWACMMSGLPEN          RCC_ETHSWACMMSGCFGR_ETHSWACMMSGLPEN_Msk               /*!< ETHSW_ACM message buffer clock enable during CSleep  */

/* Bit fields for RCC_STGENCFGR register */
#define RCC_STGENCFGR_STGENEN_Pos                    (1U)
#define RCC_STGENCFGR_STGENEN_Msk                    (0x1UL << RCC_STGENCFGR_STGENEN_Pos)                   /*!< 0x00000002 */
#define RCC_STGENCFGR_STGENEN                        RCC_STGENCFGR_STGENEN_Msk                             /*!< STGENRW and STGENRO clock enable */
#define RCC_STGENCFGR_STGENLPEN_Pos                  (2U)
#define RCC_STGENCFGR_STGENLPEN_Msk                  (0x1UL << RCC_STGENCFGR_STGENLPEN_Pos)                 /*!< 0x00000004 */
#define RCC_STGENCFGR_STGENLPEN                      RCC_STGENCFGR_STGENLPEN_Msk                           /*!< STGENRW and STGENRO clock enable during CSleep */
#define RCC_STGENCFGR_STGENSTPEN_Pos                 (4U)
#define RCC_STGENCFGR_STGENSTPEN_Msk                 (0x1UL << RCC_STGENCFGR_STGENSTPEN_Pos)                /*!< 0x00000010 */
#define RCC_STGENCFGR_STGENSTPEN                     RCC_STGENCFGR_STGENSTPEN_Msk                          /*!< STGENRW and STGENRO kernel clock enable during CStop  */

