STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_ca35.h
/* Bit fields for USB3_GHWPARAMS2 register */
#define USB3_GHWPARAMS2_ghwparams2_31_0_Pos                      0
#define USB3_GHWPARAMS2_ghwparams2_31_0_Msk                      (0xFFFFFFFFUL << 0)
#define USB3_GHWPARAMS2_ghwparams2_31_0                          (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GHWPARAMS3 register */
#define USB3_GHWPARAMS3_ghwparams3_1_0_Pos                       0
#define USB3_GHWPARAMS3_ghwparams3_1_0_Msk                       (0x3UL << 0)
#define USB3_GHWPARAMS3_ghwparams3_1_0                           (0x3UL << 0)
#define USB3_GHWPARAMS3_ghwparams3_3_2_Pos                       2
#define USB3_GHWPARAMS3_ghwparams3_3_2_Msk                       (0x3UL << 2)
#define USB3_GHWPARAMS3_ghwparams3_3_2                           (0x3UL << 2)
#define USB3_GHWPARAMS3_ghwparams3_5_4_Pos                       4
#define USB3_GHWPARAMS3_ghwparams3_5_4_Msk                       (0x3UL << 4)
#define USB3_GHWPARAMS3_ghwparams3_5_4                           (0x3UL << 4)
#define USB3_GHWPARAMS3_ghwparams3_7_6_Pos                       6
#define USB3_GHWPARAMS3_ghwparams3_7_6_Msk                       (0x3UL << 6)
#define USB3_GHWPARAMS3_ghwparams3_7_6                           (0x3UL << 6)
#define USB3_GHWPARAMS3_ghwparams3_9_8_Pos                       8
#define USB3_GHWPARAMS3_ghwparams3_9_8_Msk                       (0x3UL << 8)
#define USB3_GHWPARAMS3_ghwparams3_9_8                           (0x3UL << 8)
#define USB3_GHWPARAMS3_ghwparams3_10_Pos                        10
#define USB3_GHWPARAMS3_ghwparams3_10_Msk                        (0x1UL << 10)
#define USB3_GHWPARAMS3_ghwparams3_10                            (0x1UL << 10)
#define USB3_GHWPARAMS3_ghwparams3_11_Pos                        11
#define USB3_GHWPARAMS3_ghwparams3_11_Msk                        (0x1UL << 11)
#define USB3_GHWPARAMS3_ghwparams3_11                            (0x1UL << 11)
#define USB3_GHWPARAMS3_ghwparams3_17_12_Pos                     12
#define USB3_GHWPARAMS3_ghwparams3_17_12_Msk                     (0x3fUL << 12)
#define USB3_GHWPARAMS3_ghwparams3_17_12                         (0x3fUL << 12)
#define USB3_GHWPARAMS3_ghwparams3_22_18_Pos                     18
#define USB3_GHWPARAMS3_ghwparams3_22_18_Msk                     (0x1fUL << 18)
#define USB3_GHWPARAMS3_ghwparams3_22_18                         (0x1fUL << 18)
#define USB3_GHWPARAMS3_ghwparams3_30_23_Pos                     23
#define USB3_GHWPARAMS3_ghwparams3_30_23_Msk                     (0xffUL << 23)
#define USB3_GHWPARAMS3_ghwparams3_30_23                         (0xffUL << 23)
#define USB3_GHWPARAMS3_ghwparams3_31_Pos                        31
#define USB3_GHWPARAMS3_ghwparams3_31_Msk                        (0x1UL << 31)
#define USB3_GHWPARAMS3_ghwparams3_31                            (0x1UL << 31)

/* Bit fields for USB3_GHWPARAMS4 register */
#define USB3_GHWPARAMS4_ghwparams4_5_0_Pos                       0
#define USB3_GHWPARAMS4_ghwparams4_5_0_Msk                       (0x3fUL << 0)
#define USB3_GHWPARAMS4_ghwparams4_5_0                           (0x3fUL << 0)
#define USB3_GHWPARAMS4_ghwparams4_6_Pos                         6
#define USB3_GHWPARAMS4_ghwparams4_6_Msk                         (0x1UL << 6)
#define USB3_GHWPARAMS4_ghwparams4_6                             (0x1UL << 6)
#define USB3_GHWPARAMS4_ghwparams4_8_7_Pos                       7
#define USB3_GHWPARAMS4_ghwparams4_8_7_Msk                       (0x3UL << 7)
#define USB3_GHWPARAMS4_ghwparams4_8_7                           (0x3UL << 7)
#define USB3_GHWPARAMS4_ghwparams4_10_9_Pos                      9
#define USB3_GHWPARAMS4_ghwparams4_10_9_Msk                      (0x3UL << 9)
#define USB3_GHWPARAMS4_ghwparams4_10_9                          (0x3UL << 9)
#define USB3_GHWPARAMS4_ghwparams4_11_Pos                        11
#define USB3_GHWPARAMS4_ghwparams4_11_Msk                        (0x1UL << 11)
#define USB3_GHWPARAMS4_ghwparams4_11                            (0x1UL << 11)
#define USB3_GHWPARAMS4_ghwparams4_12_Pos                        12
#define USB3_GHWPARAMS4_ghwparams4_12_Msk                        (0x1UL << 12)
#define USB3_GHWPARAMS4_ghwparams4_12                            (0x1UL << 12)
#define USB3_GHWPARAMS4_ghwparams4_16_13_Pos                     13
#define USB3_GHWPARAMS4_ghwparams4_16_13_Msk                     (0xfUL << 13)
#define USB3_GHWPARAMS4_ghwparams4_16_13                         (0xfUL << 13)
#define USB3_GHWPARAMS4_ghwparams4_20_17_Pos                     17
#define USB3_GHWPARAMS4_ghwparams4_20_17_Msk                     (0xfUL << 17)
#define USB3_GHWPARAMS4_ghwparams4_20_17                         (0xfUL << 17)
#define USB3_GHWPARAMS4_ghwparams4_21_Pos                        21
#define USB3_GHWPARAMS4_ghwparams4_21_Msk                        (0x1UL << 21)
#define USB3_GHWPARAMS4_ghwparams4_21                            (0x1UL << 21)
#define USB3_GHWPARAMS4_ghwparams4_22_Pos                        22
#define USB3_GHWPARAMS4_ghwparams4_22_Msk                        (0x1UL << 22)
#define USB3_GHWPARAMS4_ghwparams4_22                            (0x1UL << 22)
#define USB3_GHWPARAMS4_ghwparams4_23_Pos                        23
#define USB3_GHWPARAMS4_ghwparams4_23_Msk                        (0x1UL << 23)
#define USB3_GHWPARAMS4_ghwparams4_23                            (0x1UL << 23)
#define USB3_GHWPARAMS4_ghwparams4_27_24_Pos                     24
#define USB3_GHWPARAMS4_ghwparams4_27_24_Msk                     (0xfUL << 24)
#define USB3_GHWPARAMS4_ghwparams4_27_24                         (0xfUL << 24)
#define USB3_GHWPARAMS4_ghwparams4_31_28_Pos                     28
#define USB3_GHWPARAMS4_ghwparams4_31_28_Msk                     (0xfUL << 28)
#define USB3_GHWPARAMS4_ghwparams4_31_28                         (0xfUL << 28)

/* Bit fields for USB3_GHWPARAMS5 register */
#define USB3_GHWPARAMS5_ghwparams5_3_0_Pos                       0
#define USB3_GHWPARAMS5_ghwparams5_3_0_Msk                       (0xfUL << 0)
#define USB3_GHWPARAMS5_ghwparams5_3_0                           (0xfUL << 0)
#define USB3_GHWPARAMS5_ghwparams5_9_4_Pos                       4
#define USB3_GHWPARAMS5_ghwparams5_9_4_Msk                       (0x3fUL << 4)
#define USB3_GHWPARAMS5_ghwparams5_9_4                           (0x3fUL << 4)
#define USB3_GHWPARAMS5_ghwparams5_15_10_Pos                     10
#define USB3_GHWPARAMS5_ghwparams5_15_10_Msk                     (0x3fUL << 10)
#define USB3_GHWPARAMS5_ghwparams5_15_10                         (0x3fUL << 10)
#define USB3_GHWPARAMS5_ghwparams5_21_16_Pos                     16
#define USB3_GHWPARAMS5_ghwparams5_21_16_Msk                     (0x3fUL << 16)
#define USB3_GHWPARAMS5_ghwparams5_21_16                         (0x3fUL << 16)
#define USB3_GHWPARAMS5_ghwparams5_27_22_Pos                     22
#define USB3_GHWPARAMS5_ghwparams5_27_22_Msk                     (0x3fUL << 22)
#define USB3_GHWPARAMS5_ghwparams5_27_22                         (0x3fUL << 22)
#define USB3_GHWPARAMS5_ghwparams5_31_28_Pos                     28
#define USB3_GHWPARAMS5_ghwparams5_31_28_Msk                     (0xfUL << 28)
#define USB3_GHWPARAMS5_ghwparams5_31_28                         (0xfUL << 28)

/* Bit fields for USB3_GHWPARAMS6 register */
#define USB3_GHWPARAMS6_ghwparams6_5_0_Pos                       0
#define USB3_GHWPARAMS6_ghwparams6_5_0_Msk                       (0x3fUL << 0)
#define USB3_GHWPARAMS6_ghwparams6_5_0                           (0x3fUL << 0)
#define USB3_GHWPARAMS6_ghwparams6_6_Pos                         6
#define USB3_GHWPARAMS6_ghwparams6_6_Msk                         (0x1UL << 6)
#define USB3_GHWPARAMS6_ghwparams6_6                             (0x1UL << 6)
#define USB3_GHWPARAMS6_ghwparams6_7_Pos                         7
#define USB3_GHWPARAMS6_ghwparams6_7_Msk                         (0x1UL << 7)
#define USB3_GHWPARAMS6_ghwparams6_7                             (0x1UL << 7)
#define USB3_GHWPARAMS6_ghwparams6_9_8_Pos                       8
#define USB3_GHWPARAMS6_ghwparams6_9_8_Msk                       (0x3UL << 8)
#define USB3_GHWPARAMS6_ghwparams6_9_8                           (0x3UL << 8)
#define USB3_GHWPARAMS6_SRPSupport_Pos                           10
#define USB3_GHWPARAMS6_SRPSupport_Msk                           (0x1UL << 10)
#define USB3_GHWPARAMS6_SRPSupport                               (0x1UL << 10)
#define USB3_GHWPARAMS6_HNPSupport_Pos                           11
#define USB3_GHWPARAMS6_HNPSupport_Msk                           (0x1UL << 11)
#define USB3_GHWPARAMS6_HNPSupport                               (0x1UL << 11)
#define USB3_GHWPARAMS6_ADPSupport_Pos                           12
#define USB3_GHWPARAMS6_ADPSupport_Msk                           (0x1UL << 12)
#define USB3_GHWPARAMS6_ADPSupport                               (0x1UL << 12)
#define USB3_GHWPARAMS6_OTG_SS_Support_Pos                       13
#define USB3_GHWPARAMS6_OTG_SS_Support_Msk                       (0x1UL << 13)
#define USB3_GHWPARAMS6_OTG_SS_Support                           (0x1UL << 13)
#define USB3_GHWPARAMS6_BCSupport_Pos                            14
#define USB3_GHWPARAMS6_BCSupport_Msk                            (0x1UL << 14)
#define USB3_GHWPARAMS6_BCSupport                                (0x1UL << 14)
#define USB3_GHWPARAMS6_BusFltrsSupport_Pos                      15
#define USB3_GHWPARAMS6_BusFltrsSupport_Msk                      (0x1UL << 15)
#define USB3_GHWPARAMS6_BusFltrsSupport                          (0x1UL << 15)
#define USB3_GHWPARAMS6_ghwparams6_31_16_Pos                     16
#define USB3_GHWPARAMS6_ghwparams6_31_16_Msk                     (0xffffUL << 16)
#define USB3_GHWPARAMS6_ghwparams6_31_16                         (0xffffUL << 16)

/* Bit fields for USB3_GHWPARAMS7 register */
#define USB3_GHWPARAMS7_ghwparams7_15_0_Pos                      0
#define USB3_GHWPARAMS7_ghwparams7_15_0_Msk                      (0xffffUL << 0)
#define USB3_GHWPARAMS7_ghwparams7_15_0                          (0xffffUL << 0)
#define USB3_GHWPARAMS7_ghwparams7_31_16_Pos                     16
#define USB3_GHWPARAMS7_ghwparams7_31_16_Msk                     (0xffffUL << 16)
#define USB3_GHWPARAMS7_ghwparams7_31_16                         (0xffffUL << 16)

